; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite1 - satellite
	instrument9 - instrument
	satellite2 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	satellite3 - satellite
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	instrument22 - instrument
	instrument23 - instrument
	instrument24 - instrument
	instrument25 - instrument
	satellite4 - satellite
	instrument26 - instrument
	infrared5 - mode
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	image6 - mode
	thermograph7 - mode
	thermograph4 - mode
	thermograph3 - mode
	star0 - direction
	groundstation1 - direction
	groundstation3 - direction
	groundstation4 - direction
	groundstation2 - direction
	planet5 - direction
	planet6 - direction
	phenomenon7 - direction
	phenomenon8 - direction
	star9 - direction
	star10 - direction
	star11 - direction
	star12 - direction
	planet13 - direction
	phenomenon14 - direction
	planet15 - direction
	planet16 - direction
	phenomenon17 - direction
	planet18 - direction
	phenomenon19 - direction
	planet20 - direction
	phenomenon21 - direction
	star22 - direction
	planet23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image6)
	(calibration_target instrument0 groundstation1)
	(supports instrument1 image6)
	(calibration_target instrument1 groundstation4)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph7)
	(calibration_target instrument2 groundstation1)
	(supports instrument3 thermograph7)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 groundstation3)
	(supports instrument4 image1)
	(calibration_target instrument4 groundstation3)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 star0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 groundstation2)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared5)
	(calibration_target instrument7 star0)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 groundstation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(on_board instrument5 satellite0)
	(on_board instrument6 satellite0)
	(on_board instrument7 satellite0)
	(on_board instrument8 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet16)
	(supports instrument9 thermograph3)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 groundstation1)
	(on_board instrument9 satellite1)
	(power_avail satellite1)
	(pointing satellite1 planet18)
	(supports instrument10 thermograph7)
	(calibration_target instrument10 groundstation2)
	(supports instrument11 thermograph2)
	(supports instrument11 image1)
	(supports instrument11 infrared5)
	(calibration_target instrument11 groundstation3)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 groundstation3)
	(supports instrument13 thermograph3)
	(supports instrument13 thermograph4)
	(calibration_target instrument13 star0)
	(supports instrument14 image6)
	(calibration_target instrument14 groundstation2)
	(supports instrument15 thermograph3)
	(calibration_target instrument15 groundstation1)
	(supports instrument16 thermograph3)
	(calibration_target instrument16 groundstation1)
	(on_board instrument10 satellite2)
	(on_board instrument11 satellite2)
	(on_board instrument12 satellite2)
	(on_board instrument13 satellite2)
	(on_board instrument14 satellite2)
	(on_board instrument15 satellite2)
	(on_board instrument16 satellite2)
	(power_avail satellite2)
	(pointing satellite2 phenomenon8)
	(supports instrument17 thermograph3)
	(calibration_target instrument17 groundstation2)
	(supports instrument18 thermograph3)
	(supports instrument18 thermograph2)
	(supports instrument18 infrared5)
	(calibration_target instrument18 groundstation2)
	(supports instrument19 image1)
	(supports instrument19 thermograph4)
	(supports instrument19 infrared5)
	(calibration_target instrument19 groundstation1)
	(supports instrument20 thermograph3)
	(supports instrument20 thermograph0)
	(calibration_target instrument20 groundstation4)
	(supports instrument21 image6)
	(supports instrument21 image1)
	(calibration_target instrument21 star0)
	(supports instrument22 infrared5)
	(supports instrument22 thermograph7)
	(calibration_target instrument22 star0)
	(supports instrument23 image1)
	(supports instrument23 thermograph4)
	(supports instrument23 thermograph0)
	(calibration_target instrument23 groundstation1)
	(supports instrument24 thermograph4)
	(supports instrument24 image6)
	(supports instrument24 thermograph2)
	(calibration_target instrument24 groundstation3)
	(supports instrument25 thermograph3)
	(supports instrument25 thermograph4)
	(supports instrument25 thermograph7)
	(calibration_target instrument25 groundstation4)
	(on_board instrument17 satellite3)
	(on_board instrument18 satellite3)
	(on_board instrument19 satellite3)
	(on_board instrument20 satellite3)
	(on_board instrument21 satellite3)
	(on_board instrument22 satellite3)
	(on_board instrument23 satellite3)
	(on_board instrument24 satellite3)
	(on_board instrument25 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon8)
	(supports instrument26 thermograph3)
	(calibration_target instrument26 groundstation2)
	(on_board instrument26 satellite4)
	(power_avail satellite4)
	(pointing satellite4 planet15)
)
(:goal (and
	(have_image planet5 image6)
	(have_image planet6 thermograph4)
	(have_image planet6 thermograph0)
	(have_image phenomenon8 thermograph0)
	(have_image phenomenon8 thermograph7)
	(have_image star9 image1)
	(have_image star10 infrared5)
	(have_image star10 image1)
	(have_image star11 infrared5)
	(have_image star11 thermograph3)
	(have_image star12 infrared5)
	(have_image planet13 thermograph3)
	(have_image phenomenon14 thermograph0)
	(have_image phenomenon14 image6)
	(have_image planet15 image1)
	(have_image planet16 image1)
	(have_image phenomenon17 infrared5)
	(have_image phenomenon17 thermograph7)
	(have_image planet18 image1)
	(have_image planet18 infrared5)
	(have_image planet20 thermograph7)
	(have_image phenomenon21 thermograph7)
	(have_image star22 thermograph4)
	(have_image star22 thermograph7)
	(have_image planet23 infrared5)
	(have_image phenomenon24 thermograph4)
	(have_image phenomenon24 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 27
2. (switch_on instrument10 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument10)
   goals met: 0 of 27
3. (switch_on instrument9 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument9)
   goals met: 0 of 27
4. (turn_to satellite1 groundstation1 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 27
5. (calibrate satellite1 instrument9 groundstation1)
   added: (calibrated instrument9)
   goals met: 0 of 27
6. (turn_to satellite1 phenomenon24 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon24)
   goals met: 0 of 27
7. (take_image satellite1 phenomenon24 instrument9 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 1 of 27
8. (switch_on instrument23 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument23)
   goals met: 1 of 27
9. (turn_to satellite3 groundstation1 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 groundstation1)
   goals met: 1 of 27
10. (calibrate satellite3 instrument23 groundstation1)
   added: (calibrated instrument23)
   goals met: 1 of 27
11. (turn_to satellite3 phenomenon14 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon14)
   goals met: 1 of 27
12. (take_image satellite3 phenomenon14 instrument23 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 2 of 27
13. (turn_to satellite3 groundstation2 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 groundstation2)
   goals met: 2 of 27
14. (turn_to satellite1 planet13 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 planet13)
   goals met: 2 of 27
15. (take_image satellite1 planet13 instrument9 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 3 of 27
16. (turn_to satellite1 star11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star11)
   goals met: 3 of 27
17. (take_image satellite1 star11 instrument9 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 4 of 27
18. (turn_to satellite0 groundstation1 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 27
19. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 4 of 27
20. (turn_to satellite0 phenomenon14 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 27
21. (take_image satellite0 phenomenon14 instrument0 image6)
   added: (have_image phenomenon14 image6)
   goals met: 5 of 27
22. (turn_to satellite0 planet5 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet5)
   goals met: 5 of 27
23. (take_image satellite0 planet5 instrument0 image6)
   added: (have_image planet5 image6)
   goals met: 6 of 27
24. (turn_to satellite3 phenomenon24 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon24)
   goals met: 6 of 27
25. (take_image satellite3 phenomenon24 instrument23 thermograph4)
   added: (have_image phenomenon24 thermograph4)
   goals met: 7 of 27
26. (turn_to satellite3 groundstation2 phenomenon24)
   deleted: (pointing satellite3 phenomenon24)
   added: (pointing satellite3 groundstation2)
   goals met: 7 of 27
27. (turn_to satellite3 phenomenon8 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon8)
   goals met: 7 of 27
28. (take_image satellite3 phenomenon8 instrument23 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 8 of 27
29. (turn_to satellite3 groundstation2 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 groundstation2)
   goals met: 8 of 27
30. (turn_to satellite3 planet15 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet15)
   goals met: 8 of 27
31. (take_image satellite3 planet15 instrument23 image1)
   added: (have_image planet15 image1)
   goals met: 9 of 27
32. (turn_to satellite3 groundstation2 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 groundstation2)
   goals met: 9 of 27
33. (turn_to satellite3 planet16 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet16)
   goals met: 9 of 27
34. (take_image satellite3 planet16 instrument23 image1)
   added: (have_image planet16 image1)
   goals met: 10 of 27
35. (turn_to satellite3 groundstation2 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 groundstation2)
   goals met: 10 of 27
36. (turn_to satellite3 planet18 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet18)
   goals met: 10 of 27
37. (take_image satellite3 planet18 instrument23 image1)
   added: (have_image planet18 image1)
   goals met: 11 of 27
38. (turn_to satellite3 planet6 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet6)
   goals met: 11 of 27
39. (take_image satellite3 planet6 instrument23 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 12 of 27
40. (take_image satellite3 planet6 instrument23 thermograph4)
   added: (have_image planet6 thermograph4)
   goals met: 13 of 27
41. (turn_to satellite3 phenomenon17 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon17)
   goals met: 13 of 27
42. (turn_to satellite2 phenomenon21 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon21)
   goals met: 13 of 27
43. (switch_off instrument23 satellite3)
   deleted: (power_on instrument23)
   added: (power_avail satellite3)
   goals met: 13 of 27
44. (switch_on instrument19 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument19)
   goals met: 13 of 27
45. (turn_to satellite0 star22 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star22)
   goals met: 13 of 27
46. (take_image satellite0 star22 instrument0 thermograph4)
   added: (have_image star22 thermograph4)
   goals met: 14 of 27
47. (turn_to satellite3 groundstation1 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 groundstation1)
   goals met: 14 of 27
48. (calibrate satellite3 instrument19 groundstation1)
   added: (calibrated instrument19)
   goals met: 14 of 27
49. (turn_to satellite3 phenomenon17 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon17)
   goals met: 14 of 27
50. (take_image satellite3 phenomenon17 instrument19 infrared5)
   added: (have_image phenomenon17 infrared5)
   goals met: 15 of 27
51. (turn_to satellite3 planet18 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 planet18)
   goals met: 15 of 27
52. (take_image satellite3 planet18 instrument19 infrared5)
   added: (have_image planet18 infrared5)
   goals met: 16 of 27
53. (turn_to satellite3 planet23 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet23)
   goals met: 16 of 27
54. (take_image satellite3 planet23 instrument19 infrared5)
   added: (have_image planet23 infrared5)
   goals met: 17 of 27
55. (turn_to satellite3 star10 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 star10)
   goals met: 17 of 27
56. (take_image satellite3 star10 instrument19 image1)
   added: (have_image star10 image1)
   goals met: 18 of 27
57. (take_image satellite3 star10 instrument19 infrared5)
   added: (have_image star10 infrared5)
   goals met: 19 of 27
58. (turn_to satellite3 star11 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star11)
   goals met: 19 of 27
59. (take_image satellite3 star11 instrument19 infrared5)
   added: (have_image star11 infrared5)
   goals met: 20 of 27
60. (turn_to satellite3 star12 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star12)
   goals met: 20 of 27
61. (take_image satellite3 star12 instrument19 infrared5)
   added: (have_image star12 infrared5)
   goals met: 21 of 27
62. (turn_to satellite3 star9 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star9)
   goals met: 21 of 27
63. (take_image satellite3 star9 instrument19 image1)
   added: (have_image star9 image1)
   goals met: 22 of 27
64. (turn_to satellite2 groundstation2 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 groundstation2)
   goals met: 22 of 27
65. (calibrate satellite2 instrument10 groundstation2)
   added: (calibrated instrument10)
   goals met: 22 of 27
66. (turn_to satellite2 phenomenon17 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon17)
   goals met: 22 of 27
67. (take_image satellite2 phenomenon17 instrument10 thermograph7)
   added: (have_image phenomenon17 thermograph7)
   goals met: 23 of 27
68. (turn_to satellite2 phenomenon21 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon21)
   goals met: 23 of 27
69. (take_image satellite2 phenomenon21 instrument10 thermograph7)
   added: (have_image phenomenon21 thermograph7)
   goals met: 24 of 27
70. (turn_to satellite2 phenomenon8 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 phenomenon8)
   goals met: 24 of 27
71. (take_image satellite2 phenomenon8 instrument10 thermograph7)
   added: (have_image phenomenon8 thermograph7)
   goals met: 25 of 27
72. (turn_to satellite2 planet20 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet20)
   goals met: 25 of 27
73. (take_image satellite2 planet20 instrument10 thermograph7)
   added: (have_image planet20 thermograph7)
   goals met: 26 of 27
74. (turn_to satellite2 star22 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 star22)
   goals met: 26 of 27
75. (take_image satellite2 star22 instrument10 thermograph7)
   added: (have_image star22 thermograph7)
   goals met: 27 of 27
